# Pandas Operations:

In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({'col1' : [1,2,3,4],
                   'col2' : [444,555,666,444],
                   'col3' : ['abc','def','ghi','xyz']
                  })
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
df.head(2)
# This function returns the first `n` rows for the object based on position

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [4]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

---

## Finding Unique Values :
> **Syntax: `df_name[columnName].unique()`**

In [17]:
df['col2'].unique()

# returns NumPy array of all the Unique values of 'col2' by default.

array([444, 555, 666], dtype=int64)

---

---

## length of the unique values: 
> **Syntax: `df_name[columnName].nunique()`**

In [14]:
# length of the unique values in 'col2'
df['col2'].nunique()
# OR
# len(df['col2'].unique()

3

---

## Finding the occurance of Each values in particular column:
> **Syntax: `df_name['columnName'].value_counts()`**

In [16]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64